# Python Exercises

The following provides a very brief introduction to some of the basics of Python. If any of this seems new, please work on your own to learn the basics.  W3Schools' [online python tutorial](https://www.w3schools.com/python/default.asp) is a great place to start.  Official documentation for python can be found [here](https://docs.python.org/3.10/).

## Exercise 1: Loop Iteration

A loop in Python is used to iterate over a sequence (like a list, tuple, or string) and execute a block of code for each item in the sequence. The for loop is one of the most common loops in Python.

For example:

In [2]:
# This is a loop from 1 to 10
for i in range(1, 11):
    print(i)

1
2
3
4
5
6
7
8
9
10

### Task

Create a loop that prints numbers from 0 to 20, counting by 2's.  **HINT**:  Look up the syntax of the [range](https://www.w3schools.com/python/ref_func_range.asp) function.

In [4]:
# Place your code here

## Exercise 2: Define a Function

In Python, a function is a reusable block of code that performs a specific task. You define a function using the def keyword, followed by the function name, parameters in parentheses, and a colon. The function body follows the colon and is indented.  You "call" a function, by typing the name of the function and putting an required parameters in parenthses.

For example:

In [3]:
def square(num):
    return num * num

square(10)

100

### Task

Create a function that returns the sqaure root of a number.  **HINT**:  Look up how to use the [math library](https://www.w3schools.com/python/python_math.asp).

In [ ]:
# Place your code here

## Exercise 3: Import Libraries

Libraries in Python are collections of functions and methods that allow you to perform many actions without writing much code. To use a library, you first have to import it using the import keyword.  If you did the previous assignment, you imported the `math` library. You can also give libraries an alias to make them easier to reference in your code.

For example, `numpy` is a library containing many advanced mathematical routines.  Very often you will see it imported like this:

In [6]:
import numpy as np

np.sqrt([4,9,25])

array([2., 3., 5.])

### Task

Import the scipy constants library and print out the speed of light.  **Hint** look at a tutorial on [scipy](https://www.w3schools.com/python/scipy/index.php).

## Exercise 4: Working with Lists

Lists are one of the most common data structures in Python. They are ordered, mutable (changeable), and allow duplicate members.

For example, to create a list of numbers and append a new number:

In [7]:
numbers = [1, 2, 3, 4, 5]
numbers.append(6)
print(numbers)

[1, 2, 3, 4, 5, 6]

### Task

Create a list of fruits and add "Grape" to the list.

In [15]:
# Place code here

## Exercise 5: Conditional Statements

Conditional statements in Python allow you to perform different actions depending on whether a specified condition evaluates to true or false.

Here's how you use an if-else statement to check if a number is even or odd:

In [8]:
num = 5
if num % 2 == 0:
    print("Even")
else:
    print("Odd")

Odd

### Task

Write a conditional statement to check if a number is positive, negative, or zero.

In [9]:
# Place code here

## Exercise 6: Working with Dictionaries
Dictionaries are key-value pairs where the value can be almost any Python object. They are unordered, changeable, and indexed by keys.

To create a dictionary and access the value for a given key:

In [10]:
student = {"name": "John", "age": 25, "course": "Computer Science"}
print(student["name"])

John

### Task 

Create a dictionary that represents a book with keys: "title", "author", and "year_published". Access and print the book's title.

## Exercise 7: String Manipulation
Strings in Python are arrays of bytes representing Unicode characters. Python has a set of built-in methods to manipulate strings.

Here's how you can concatenate strings and change the case:

In [11]:
greeting = "hello"
name = "world"
message = greeting.capitalize() + ", " + name.upper() + "!"
print(message)

Hello, WORLD!

### Task

Take the string "python is awesome" and transform it to "PYTHON IS AWESOME".

In [16]:
# Place code here

## Exercise 9: List Comprehensions
List comprehensions provide a concise way to create lists. They can be used to create a new list by performing some operation on each item in an existing list (or other iterable).

Here's how you can create a list of squares for numbers from 1 to 5:

In [13]:
squares = [x**2 for x in range(1, 6)]
print(squares)

[1, 4, 9, 16, 25]

### Task

Using list comprehension, generate a list of cubes for numbers from 1 to 7.

In [14]:
# Place code here

## Exercise 8: Exception Handling

Python has built-in mechanisms for handling errors or exceptions. This allows the programmer to gracefully handle unexpected situations and prevent the program from crashing.

Here's how you can handle a division by zero error using try-except:

In [12]:
try:
    result = 10 / 0
except ZeroDivisionError:
    print("Cannot divide by zero!")

Cannot divide by zero!

### Task

Write a piece of code that tries to access a key that doesn't exist in a dictionary, and handle the resulting KeyError exception gracefully.

In [17]:
# Place code here

# Pandas Exercises

Pandas is a powerful and popular data analysis library for Python. It provides data structures for efficiently storing large datasets and tools for reshaping, aggregating, merging, and summarizing data.

In order to work with Pandas, it's helpful to have a little sample data to work with.  Execute the following cell to generate some "fake" data.  This will create a new Pandas DataFrame and assign it to a variable `df`.

In [19]:
import random
import pandas as pd
import numpy as np

# Set a random seed for reproducibility
np.random.seed(42)

# Generate sample data
regions = ['NE', 'NW', 'SE', 'SW', 'S', 'N', 'E', 'W']
data = {
    'Price': np.random.uniform(10, 100, 200),
    'Region': np.random.choice(regions, 200)
}

# Convert data to a pandas DataFrame
df = pd.DataFrame(data)

# Randomly generate "Product" data
products = ['Laptop', 'Desktop', 'Tablet', 'Smartphone', 'Smartwatch', 'Headphones']
product_data = [random.choice(products) for _ in range(200)]

# Randomly generate "Quantity Sold" data
quantity_data = [random.randint(1, 50) for _ in range(200)]

# Randomly generate "Sales Rep" data
sales_reps = ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah']
sales_rep_data = [random.choice(sales_reps) for _ in range(200)]

# Add these columns to the dataframe
df['Product'] = product_data
df['Quantity Sold'] = quantity_data
df['Sales Rep'] = sales_rep_data

df

         Price Region     Product  Quantity Sold Sales Rep
0    43.708611      W      Tablet             46     Frank
1    95.564288     SW      Laptop              5    Hannah
2    75.879455     SE     Desktop              2   Charlie
3    63.879264     NE  Smartwatch             14     David
4    24.041678      W      Tablet              2       Eve
..         ...    ...         ...            ...       ...
195  41.428862     SW      Tablet              7     Frank
196  75.336011      S      Tablet             44     Grace
197  90.739923      E      Tablet             16     Frank
198  89.837778     SW      Tablet             20     Frank
199  80.188799      N  Smartphone             36     Frank

[200 rows x 5 columns]

## Exercise 1: Filtering Data

Pandas allows for row selection using boolean indexing. This is similar to SQL's WHERE clause. You can filter rows based on column values.

Here's how you filter data to select rows where Price > 30 and Region is 'NE':

In [20]:
filtered_data = df[(df['Price'] > 30) & (df['Region'] == 'NE')]
filtered_data

         Price Region     Product  Quantity Sold Sales Rep
3    63.879264     NE  Smartwatch             14     David
28   63.317311     NE  Smartwatch             43     Grace
30   64.679037     NE  Smartwatch             28    Hannah
63   42.107799     NE      Tablet             14    Hannah
67   82.197728     NE      Laptop             15     Frank
76   79.414331     NE     Desktop              5     Frank
78   42.261916     NE  Smartphone             13     Grace
88   89.849147     NE  Headphones             19       Bob
92   78.470654     NE      Tablet             27       Bob
105  32.436301     NE  Smartwatch             33       Bob
110  36.077631     NE  Smartphone              1     Frank
130  47.566990     NE      Laptop             47   Charlie
133  40.385365     NE  Smartwatch             29     Grace
144  35.635644     NE  Smartwatch             48     David
150  91.743930     NE      Tablet             22     Grace
154  98.708541     NE      Laptop             36   Charlie
172  56.088375     NE  Headphones             30     Grace

### Task 

Use pandas to select rows where Price < 30 and the Region is one of "S" or "SE".

In [22]:
#Place code here

## Exercise 2: Applying Functions to Columns

In Pandas, you can apply a function to a column using the apply() method. This is useful for transforming data or creating new columns based on existing ones.

Here's how you create a new column called Discounted_Price that is 90% of the Price column:

In [23]:
df['Discounted_Price'] = df['Price'].apply(lambda x: 0.9 * x)
df

         Price Region     Product  Quantity Sold Sales Rep  Discounted_Price
0    43.708611      W      Tablet             46     Frank         39.337750
1    95.564288     SW      Laptop              5    Hannah         86.007859
2    75.879455     SE     Desktop              2   Charlie         68.291509
3    63.879264     NE  Smartwatch             14     David         57.491337
4    24.041678      W      Tablet              2       Eve         21.637510
..         ...    ...         ...            ...       ...               ...
195  41.428862     SW      Tablet              7     Frank         37.285976
196  75.336011      S      Tablet             44     Grace         67.802410
197  90.739923      E      Tablet             16     Frank         81.665931
198  89.837778     SW      Tablet             20     Frank         80.854000
199  80.188799      N  Smartphone             36     Frank         72.169919

[200 rows x 6 columns]

### Task 
Create a new column called Taxed_Price that adds 10% to the Price column.

In [24]:
# Place code here

## Exercise 3: Grouping and Summarizing Data

Pandas provides the groupby method to group rows of data based on a column. This is similar to SQL's GROUP BY clause. Once data is grouped, you can aggregate it in various ways.

Here's how you can find the average Price for each Region:

In [25]:
average_price_per_region = df.groupby('Region')['Price'].mean()
average_price_per_region

Region
E     61.825292
N     55.544397
NE    47.467439
NW    49.240748
S     53.272173
SE    55.251921
SW    55.279360
W     52.023716
Name: Price, dtype: float64

### Task

Find the total `Price` for each `Region`.